Repository: MrLokans/bank_telegram_bot
Catalog: bot/locale/*/LC_MESSAGES/telegrambot.po
Languages: ru_ru

source: Test Translation
ru_ru: Тест перевода

source: I'm a bot, please talk to me!
ru_ru: Привет, я бот, пожалуйста, поговори со мной!

source: Sorry, I didn't understand that command.
ru_ru: К сожалению, я не знаю такой команды.

source: Update "{update}" caused error "{err_msg}"
ru_ru: Апдейт "{update}" вызвал ошибку "{err_msg}"

source: Buy Sell
ru_ru: Купля Продажа

source: Currencies: {curs}
ru_ru: Валюты: {curs}

source: Unknown currency: {}
ru_ru: Неизвестная валюта: {}

source: Use following commands: /course -d <days ago> -c <currency name> - display current exchange rate for the given currency or for all available currencies. /graph -d <days ago> -c <currency name> - plot currency exchange rate dynamincs for the specified period of time /banks - list names of currently supported banks. /set <bank_name> - sets default bank name for all of the operations /best -c <cur_name> -d <date diff> - best exchange rate for the given currency
ru_ru: Используйте следующие команды: /course -d <дней_назад> -c <валюта> - отобразить текущий курс обмена для указанной валюты или длявсех валют. /graph -d <дней_назад> -c <валюта> - нарисовать график обмена валютn с динамикой за указанный период времени. /banks - список поддерживаемых банков. /set <имя_банка> - установить банк по умолчанию для всех операций /best -c <валюта> -d <дней_назад> - лучший курс обмена за указанное время (сегодня по умолчанию)

source: Supported banks: {}
ru_ru: Поддерживаемые банки: {}

source: Your currently selected bank is {}
ru_ru: Вы выбрали банк {}

source: Incorrect number of arguments, please specify bank name
ru_ru: Неправильное количество параметров, пожалйста, укажите название банка

source: Incorrect bank name specified, available names are: {}
ru_ru: Указано неправильное имя банка, доступны следующие имена: {}

source: Default bank succesfully set to {}
ru_ru: Банк по умолчанию установлен на {}

source: Buy {}: <b>{}</b> - {}
ru_ru: Купля {}: <b>{}</b> - {}

source: Sell {}: <b>{}</b> - {}
ru_ru: Продажа {}: <b>{}</b> - {}

source: Best rate
ru_ru: Лучший курс
